//
//  Localizable.strings
//  Nextcloud
//
//  Copyright © 2017 Marino Faggiana. All rights reserved.
//
//  Author Marino Faggiana <marino.faggiana@nextcloud.com>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

"_cancel_"                  = "Ghaili";
"_edit_"                    = "Hariri";
"_tap_to_cancel_"           = "Gusa kusitisha";
"_tap_to_min_max_"          = "Tap to minimize / maximize";
"_cancel_request_"          = "Unataka kusitisha?";
"_upload_file_"             = "Pakia faili";
"_download_file_"           = "Pakua faili";
"_delete_"                  = "Futa";
"_rename_"                  = "Badili jina";
"_rename_file_"             = "Badilisha jina la faili";
"_rename_folder_"           = "Badilisha folda";
"_move_"                    = "Hama";
"_add_"                     = "Ongeza";
"_save_"                    = "Hifadhi";
"_warning_"                 = "Onyo";
"_error_"                   = "Hitilafu";
"_no_"                      = "Hapana";
"_yes_"                     = "Ndiyo";
"_select_"                  = "Chagua";
"_select_all_"              = "Chagua zote";
"_upload_"                  = "Pakia";
"_home_"                    = "Mafaili";
"_files_"                   = "Mafaili";
"_ok_"                      = "Sawa";
"_done_"                    = "Imefanyika";
"_clear_"                   = "Futa";
"_continue_anyway_"         = "Continue anyway";
"_selected_"                = "Imechaguliwa";
"_no_active_account_"       = "Akaunti haipo";
"_info_"                    = "Habari";
"_warning_"                 = "Onyo";
"_video_"                   = "Picha mjongeo";
"_overwrite_"               = "Futa";
"_create_"                  = "Unda";
"_create_folder_"           = "Unda folda";
"_create_folder_e2ee_"      = "Unda folda iliyosimbwa kwa njia fiche";
"_close_"                   = "Funga";
"_remove_"                  = "Ondoa";
"_file_not_found_"          = "Faili halipo";
"_continue_"                = "Endelea";
"_continue_editing_"        = "Endelea kuhariri";
"_auto_upload_folder_"      = "Pakia kiotomatiki";
"_photo_"                   = "Picha";
"_audio_"                   = "Sauti";
"_unknown_"                 = "Isiyojulikana";
"_success_"                 = "Mafanikio";
"_mode_filename_"           = "Hali ya jina la faili";
"_warning_owncloud_"        = "Umeunganishwa kwa seva ya CloudCloud. Hili halijajaribiwa na halitumiki, tumia kwa hatari yako mwenyewe. Ili kupata toleo jipya la Nextcloud, angalia https://nextcloud.com/migration.";
"_warning_unsupported_"     = "Unatumia toleo lisilotumika la Nextcloud. Kwa usalama wa data yako tunapendekeza sana usasishe hadi Nextcloud thabiti ya hivi punde";
"_restore_"                 = "Hifadhi upya";
"_tap_here_to_change_"      = "Gusa hapa kubadili";
"_no_albums_"               = "Hakuna albamu";
"_denied_album_"            = "Programu hii haina ufikiaji wa \"Picha\". Unaweza kuwezesha ufikiaji katika Mipangilio ya Faragha.";
"_denied_camera_"           = "Programu hii haina ufikiaji wa \"Kamera\". Unaweza kuwezesha ufikiaji katika Mipangilio ya Faragha.";
"_save_to_camera_roll_"        = "Save to camera roll";
"_save_to_camera_roll_desc_"   = "When enabled, photos and videos taken with the in-app camera will also be saved to your iOS camera roll.";
"_force_start_"             = "Lazimisha uanzaji";
"_account_does_not_exist_"  = "The account %@ does not exist. Please log in again.";
"_sharing_"                 = "Ushirikishaji";
"_details_"                 = "Maelezo ya kina";
"_no_permission_add_file_"  = "Huna ruhusa kuongeza mafaili";
"_no_permission_delete_file_" = "Huna ruhusa kufuta mafaili";
"_no_permission_modify_file_" = "Huna ruhusa kuboresha mafaili";
"_no_permission_favorite_file_" = "Huna ruhusa kuongeza mafaili katika vipendwa vyako";
"_add_folder_info_"         = "Ongeza taarifa za folda";
"_back_"                    = "Rudi";
"_go_back_"                 = "Go Back";
"_search_"                  = "Tafuta";
"_search_or_create_tags"    = "Search or create tag";
"_tags_"                    = "Tags";
"_share_tags_create_"       = "Create \"%@\"";
"_share_tags_no_results_"   = "No tags found";
"_share_tags_added_named_"  = "Tag %@ has been created.";
"_edit_tags_"               = "Manage tags";
"_create_tag_error_"        = "New tag could not be created. Please try again.";
"_of_"                      = "ya";
"_livephoto_save_"          = "Hifadhi picha mubashara katika albamu ya picha";
"_livephoto_save_error_"    = "Hitilafu wakati wa kuhifadhi picha mubashara";
"_livephoto_no_"            = "Zima picha mubashara";
"_convert_live_photo_"      = "Geuza katika picha mubashara";
"_file_conflict_num_"       = "mgongano wa faili";
"_file_conflicts_num_"      = "Migongano ya faili";
"_file_conflict_desc_"      = "Ungependa kuhifadhi faili zipi?\nUkichagua matoleo yote mawili, faili iliyonakiliwa itakuwa na nambari iliyoongezwa kwa jina lake.";
"_file_conflict_new_"       = "Mafaili mapya";
"_file_conflict_exists_"    = "Mafaili yapo tayari";
"_file_not_rewite_doc_"     = "Haiwezekani kubatilisha waraka lakini kuunda mpya tu.";
"_move_or_copy_"            = "Hamisha au nakili";
"_move_copy_diff_account_"  = "Huwezi kunakili au kuhamisha faili kati ya akaunti tofauti";
"_copy_"                    = "Nakala";
"_now_"                     = "Sasa";
"_wait_"                    = "Tafadhali subiri";
"_recent_"                  = "Hivi karibuni";
"_view_in_folder_"          = "Tazama kwenye folda";
"_leave_share_"             = "Acha ushiriki huu";
"_disabled_"                = "Imezimwa";
"_compact_"                 = "Kompakti";
"_normal_"                  = "Kawaida";
"_verbose_"                 = "Verbosi";
"_standard_"                = "Kawaida";
"_maximum_"                 = "Kiwango cha juu";
"_error_occurred_"          = "Hitilafu imetokea, tafadhali jaribu tena";
"_retry_"                   = "Jaribu upya";
"_images_"                  = "Taswira";
"_confirm_"                 = "Thibitisha";
"_confirm_continue_"        = "Thibitisha kwa kuendeleza upakiaji wa awali";
"_confirm_resetting_"       = "Confirm ignoring previous uploading";
"_background_location_access_title_"    = "Ufikiaji wa chimbuko la Mahali";
"_background_location_access_message_"  = "Programu hii inahitaji ufikiaji wa eneo la chinichini ili kupakia faili kiotomatiki unapohama kati ya maeneo. GPS haitumiki na eneo lako halihifadhiwi kamwe.";
"_enable_background_location_title_"    = "Wezesha chimbuko la eneo";
"_enable_background_location_message_"  = "Ili kuruhusu upakiaji wa faili otomatiki kwa chinichini, tafadhali wezesha 'Daima' kwa ufikiaji wa eneo katika Mipangilio.";
"_enable_background_location_footer_"   = "Ili kusasisha maktaba yako ya picha kiotomatiki, programu hii inaweza kutumia ufikiaji wa eneo chinichini.\nHii huiruhusu kutambua unapokuwa katika eneo jipya na kuangalia picha mpya za kupakiwa.\nGPS haitumiki, na eneo lako halihifadhiwi au kufuatiliwa kamwe.";

/* MARK: Files lock */

"_lock_"                            = "Funga ";
"_unlock_"                          = "Fugua";
"_lock_file_"                       = "Funga faili";
"_unlock_file_"                     = "Fungua faili";
"_lock_selected_files_"             = "Funga mafaili";
"_unlock_selected_files_"           = "Fungua mafaili";
"_locked_by_"                       = "Imefungwa na %@";
"_file_locked_no_override_"         = "Faili hii imefungwa. Haiwezi kubatilishwa.\n ";
"_lock_no_permissions_selected_"    = "Hairuhusiwi kwa baadhi ya faili au folda zilizochaguliwa.";
"_remove_file_"             = "Ondoa faili";
"_delete_file_"             = "Futa faili";
"_delete_folder_"           = "Futa folda";
"_size_"                    = "Ukubwa";
"_set_user_status_"         = "Hali ya mtandaoni";
"_set_user_status_message_" = "Ujumbe wa hali";
"_open_settings_"           = "Fungua mipangilio";
"_settings_account_request_" = "Omba akaunti wakati wa kuanza";
"_alias_"                   = "Alias";
"_alias_placeholder_"       = "Write alias";
"_alias_footer_"            = "Give your accounts a descriptive name such as Home, Office, School…";
"_privacy_legal_"           = "Sera ya Faragha na Kisheria";
"_source_code_"             = "Pata msimbo wa chanzo";
"_account_select_"          = "Chagua akaunti";
"_account_select_to_add_"   = "Chagua akaunti ya kuongeza";
"_remove_local_account_"    = "Ondoa akaunti ya ndani";
"_want_delete_account_"     = "Je, ungependa kuondoa akaunti ya ndani?";
"_prevent_http_redirection_"= "Kuelekeza kwingine katika HTTP hairuhusiwi.\n ";
"_http_account_insecure_"   = "This account uses an insecure HTTP server address. Data is transmitted unencrypted.";
"_https_failed_try_http_"   = "A secure connection could not be established. Do you want to try insecure HTTP instead? Your data will be transmitted unencrypted.";
"_single_file_conflict_title_" = "Mgongano wa faili";
"_multi_file_conflict_title_" = "%@ migongano ya faili";
"_replace_action_title_" = "Badili";
"_keep_both_action_title_" = "Weka zote ";
"_cancel_keep_existing_action_title_" = "Ghairi na uhifadhi iliyopo";
"_replace_all_action_title_" = "Badilisha simu";
"_keep_both_for_all_action_title_" = "Weka zote kwa wote";
"_more_action_title_" = "Maelezo zaidi";
"_wait_file_preparation_" = "Preparing file upload. Please wait …";
"_keep_active_for_upload_" = "Keep application active until upload is completed …";
"_keep_active_for_transfers_" = "Keep application active until the transfers are completed …";
"_wait_file_encryption_"  = "Tafadhali subiri, inasimba faili";
"_passcode_counter_fail_" = "Too many failed attempts. Please wait before trying again.";
"_seconds_"               = "sekunde";
"_change_lock_passcode_"  = "Badili nambari ya siri";
"_lock_cannot_disable_mdm_" = "Kuzima kifunga nambari ya siri hakuruhusiwi na wasifu wako wa usanidi.";

// MARK: User Status

/* User status */
"_online_"                  = "Mtandaoni";

/* User status */
"_away_"                    = "Mbali";

/* User status */
"_dnd_"                     = "Usisumbue";

/* User status */
"_dnd_description_"         = "Zima arifa zote";

/* User status */
"_invisible_"               = "Isiyoonekana";

/* User status */
"_invisible_description_"   = "Tokea mtandaoni";

/* User status */
"_busy_"                    = "Bize";

/* User status */
"_select_user_status_"      = "Set online status";
"_select_status_message_"      = "Pangilia ujumbe wa hali";
"_status_message_"          = "Ujumbe wa hali";
"_status_message_placehorder_"  = "Hali yako ni ipi?";
"_online_status_"           = "Hali ya mtandaoni";
"_set_status_message_"      = "Pangilia ujumbe wa hali";
"_clear_status_message_after_"  = "Clear status after";

/* User status */
"_select_option_"           = "Chagua mbadala";
"_dont_clear_"              = "Usifute";
"_15_minutes_"              = "Dakika 15";
"_30_minutes_"              = "Dakika 30";
"_an_hour_"                 = "Saa";
"_1_hour_"                  = "Saa 1";
"_4_hours_"                 = "Masaa 4";
"_day_"                     = "Leo";
"_this_week_"               = "Wiki hii";
"_days_"                    = "Siku";
"_hours_"                   = "Masaa";
"_minutes_"                 = "Dakika";


"_network_not_available_"   = "Mtandao haupo";
"_file_already_exists_"     = "Haiwezi kukamilisha oparesheni, faili lenye jina sawasawa lipo";
"_files_lock_error_"        = "Kulikuwa na hitilafu wakati wa kubadili ufungaji wa faili hili";
"_more_"                        = "Zaidi";
"_notifications_"               = "Taarifa";
"_quota_space_unlimited_"       = "Isiyona mwisho";
"_quota_space_unknown_"         = "Asiyejulikana";
"_quota_using_"                 = "Unatumia %@ ya %@";
"_acknowledgements_"            = "Shukrani";
"_settings_"                    = "Mipangilio";
"_enter_password_"              = "Ingiza nenosiri";
"_lock_"                        = "Funga ";
"_lock_active_"                 = "Funga: On";
"_lock_not_active_"             = "Funga: Off";
"_lock_protection_no_screen_"        = "Usiulize wakati wa kuanza\n ";
"_enable_touch_face_id_"        = "Washa Kitambulisho cha Kugusa/Uso";
"_wifi_only_"                   = "Tumia muunganisho wa Wi-Fi pekee";
"_settings_autoupload_"         = "Pakia picha kiotomatiki";
"_clear_cache_"                 = "Futa cache";
"_clear_cache_footer_"          = "Futa faili zilizopakuliwa na za nje ya mtandao kutoka kwa programu";
"_exit_"                        = "Weka upya programu";
"_exit_footer_"                 = "Ondoa akaunti zote na data ya ndani kutoka kwa programu.";
"_want_exit_"                   = "Makini! Itawekwa upya kwa hali ya awali. Ungependa kuendelea?";
"_want_delete_cache_"           = "Je, ungependa kufuta cache (hii pia huondoa uhamishaji unaoendelea)?";
"_add_account_"                 = "Ongeza akaunti";
"_want_delete_"                 = "Utafuta vifuatavyo:";
"_want_leave_share_"            = "Utaacha shiriki zifuatazo:";
"_no_delete_"                   = "Hapana, usifute";
"_yes_delete_"                  = "Ndiyo, futa";
"_information_"                 = "Taarifa";
"_select_offline_warning_"      = "Making multiple files and folders available offline may take a while and use a lot of memory while doing so.";
"_advanced_"                    = "ya kiwango cha juu";
"_permissions_"                 = "Ruhusa";
"_custom_permissions_"          = "Ruhusa ya mteja";
"_disable_files_app_"           = "Zima ujumuishaji wa Programu ya Faili";
"_disable_files_app_footer_"    = "Usiruhusu ufikiaji wa faili kupitia programu ya Faili za iOS.";
"_time_remaining_"              = "lliyobaki %@";
"_autoupload_"                      = "Pakia picha/video kiotomatiki";
"_autoupload_select_folder_"        = "Chagua \"Upakuaji wa kiotomatiki\" wa folda";
"_autoupload_photos_"               = "Pakia picha kiotomatiki";
"_autoupload_videos_"               = "Pakia video kiotomatiki";
"_autoupload_favorites_"            = "Pakia vipendwa pekee kiotomatiki";
"_autoupload_description_"          = "Choose whether new photos or videos will be automatically uploaded to your account.";
"_autoupload_fullphotos_"           = "Pakia mzunguko mzima wa kamera";
"_start_autoupload_"                = "Turn on auto upload";
"_stop_autoupload_"                 = "Turn off auto upload";
"_autoupload_fullphotos_footer_"    = "Rekebisha mibadala juu kabla ya kupakia";
"_autoupload_create_subfolder_"     = "Tumia folda ndogo";
"_autoupload_create_subfolder_footer_"  = "Hifadhi picha katika folda ndogo kulingana na mwaka, mwezi au siku.";
"_autoupload_subfolder_granularity_"    = "Uzito wa folda ndogo";
"_filenamemask_"                        = "Badilisha kinyago cha jina la faili";
"_filenamemask_footer_"                 = "Kwa chaguo-msingi, faili inapopakiwa, hupata umbizo lifuatalo kiotomatiki: yy-mm-dd hh-mm-ss pamoja na kihesabu cha tarakimu 4. Ikiwa haupendi umbizo hili, unaweza kuibadilisha hapa isipokuwa kihesabu cha mwisho cha tarakimu 4, ambacho hakiwezi kuachwa.";
"_autoupload_current_folder_"           = "Folda iliyochaguliwa hivi karibuni";
"_show_hidden_files_"           = "Onesha mafaili yaliyofichwa";
"_format_compatibility_"        = "Inayoendana zaidi";
"_format_compatibility_footer_" = "\"Inayoendana zaidi\" itahifadhi picha kama JPEG, ikiwezekana.";
"_privacy_"                     = "Faragha";
"_privacy_footer_"              = "Programu hii hutumia huduma kwa uchanganuzi wa ajali. Taarifa zako za kibinafsi hazijatumwa pamoja na ripoti. Iwapo unataka kuizima, tafadhali badilisha mpangilio wa \"Zima ripota wa kuacha kufanya kazi\" kuwa WASHA.";
"_crashservice_title_"          = "Lemaza ripota wa ajali";
"_crashservice_alert_"          = "Chaguo hili linahitaji kuanzishwa upya kwa programu ili kutekelezwa.";
"_upload_mov_livephoto_"        = "Picha mubashara";
"_upload_mov_livephoto_footer_" = "\"Picha ya Moja kwa Moja\" itahifadhi picha iliyochaguliwa katika umbizo la \"Picha ya Moja kwa Moja\", ikiwezekana.";
"_capabilities_"                = "Uwezo";
"_capabilities_footer_"         = "Onyesha vifurushi vinavyotumiwa na programu ikiwa vimesakinishwa na vinapatikana kwenye seva.";
"_diagnostics_"                 = "Uchunguzi";
"_diagnostics_footer_"          = "Kubadilisha kiwango cha kumbukumbu kunahitaji kuanzishwa upya kwa programu ili kutekelezwa";
"_view_log_"                    = "View log files";
"_no_log_files_"                = "No log files available";
"_clear_log_"                   = "Futa faili la kumbukumbu";
"_set_log_level_"               = "Pangilia faili la kumbukumbu";
"_log_file_clear_alert_"        = "Log file cleared!";
"_connect_server_anyway_"       = "Je unataka kuunganisha kwenye seva vyovyote vile";
"_server_is_trusted_"           = "Je unachukulia seva hii inaaminika?";
"_connection_error_"            = "Hitilafu ya muunganiko";
"_login_url_"                   = "Anwani ya seva https://...";
"_login_url_error_"             = "Hitilafu ya URL, tafadhali thibitisha URL ya seva yako";
"_login_error_"                 = "Could not log in. Please try again later.";
"_favorites_"                   = "Vipendwa";
"_favorite_short_"              = "Kipendwa ";
"_tutorial_favorite_view_"      = "Faili na folda unazoweka alama kama vipendwa zitaonekana hapa\n ";
"_tutorial_offline_view_"       = "Faili zilizonakiliwa hapa zitapatikana nje ya mtandao.\n\nZitasawazishwa na cloud yako.";
"_tutorial_groupfolders_view_"  = "No team folders yet";
"_more_"                        = "Zaidi";
"_favorite_no_files_"           = "Hakuna vipendwa bado";
"_no_date_information_"                     = "Hakuna taarifa za tarehe";
"_no_camera_information_"                   = "Hakuna taarifa za kamera";
"_no_lens_information_"                     = "Hakuna taarifa za lenzi";
"_today_"                                   = "Leo";
"_yesterday_"                               = "Jana";
"_access_photo_not_enabled_"                = "Ufikiaji wa picha haujawezeshwa";
"_access_photo_not_enabled_msg_"            = "Tafadhali nenda kwenye Mipangilio → Programu → Nextcloud → Picha na uwashe Ufikiaji wa Maktaba ya Picha";
"_access_background_app_refresh_denied_"    = "\"Uonyeshaji upya wa Programu Chinichini\" umekataliwa. Tafadhali iwashe katika \"Mipangilio\" vinginevyo, picha au video mpya hazitatambuliwa wakati programu iko chinichini.";
"_new_photos_starting_"                     = "Picha au video zinazoanzia %@ pekee ndizo zitapakiwa.";
"_tutorial_photo_view_"                     = "Bado hakuna picha au video zilizopakiwa\n ";
"_error_createsubfolders_upload_"           = "Hitilafu katika kutengeneza folda ndogo";
"_remove_photo_CameraRoll_"                 = "Ondoa kwenye safu ya kamera";
"_remove_photo_CameraRoll_desc_"            = "\"Ondoa kwenye safu ya kamera\" baada ya upakiaji, ujumbe wa uthibitisho utaonyeshwa ili kufuta picha au video zilizopakiwa kutoka kwa safu ya kamera. Picha au video zilizofutwa bado zitapatikana kwenye Tupio la Picha la iOS kwa siku 30.";
"_never_"                       = "kamwe";
"_less_a_minute_"               = "chini ya dakika iliyopita";
"_a_minute_ago_"                = "dakika iliyopita";
"_minutes_ago_"                 = "%d dakika zilizopita";
"_an_hour_ago_"                 = "saa iliyopita";
"_hours_ago_"                   = "%d masaa yaliyopita";
"_a_day_ago_"                   = "siku iliyopita";
"_days_ago_"                    = "%d siku zilizopita";
"_forbidden_characters_"        = "Wahusika waliozuiliwa: %@";
"_cannot_send_mail_error_"      = "Hakuna akaunti iliyosanidiwa, au anwani ya barua pepe isiyo sahihi imeingizwa.";
"_open_url_error_"              = "Haiwezi kufungua URL kwa kitendo hiki.";
"_media_"                       = "Media";
"_order_by_"                    = "Panga kwa";
"_name_"                        = "Jina";
"_date_"                        = "Tarehe";
"_size_"                        = "Ukubwa";
"_delete_selected_files_"       = "Futa mafaili";
"_remove_favorites_"            = "Unfavorite";
"_add_favorites_"               = "Kipendwa ";
"_share_"                       = "Shirikisha";
"_remove_local_file_"           = "Ondoa kikawaida";
"_folders_"                     = "Folda";
"_folder_"                      = "folda";
"_files_"                       = "Mafaili";
"_file_"                        = "faili";
"_no_file_pull_down_"           = "Pakia faili au vuta chini kuonesha upya";
"_no_file_no_permission_to_create_" = "Huna ruhusa ya kuunda au kupakia faili katika folda hii.";
"_limited_dimension_"           = "Kiwango cha juu kimefikiwa";
"_save_selected_files_"         = "Hifadhi katika hifadhi ya picha ";
"_file_not_saved_cameraroll_"   = "Hitilafu: Faili haikuhifadhiwa katika albamu ya picha";
"_file_saved_cameraroll_"       = "Faili ilihifadhiwa katika albamu ya picha";
"_favorite_on_top_"             = "Chagua kipendwa kwanza";
"_directory_on_top_"            = "Chagua folda kabla ya faili";
"_show_description_"            = "Onesha maelezo ya folda";
"_show_recommended_files_"      = "Onesha maoni";
"_search_no_record_found_"      = "Hakuna matokeo";
"_search_in_progress_"          = "Utafutaji unaendelea";
"_search_instruction_"          = "Tafuta faili (kiwango cha chini wahusika 2)";
"_files_no_files_"              = "Hakuna faili hapa";
"_files_no_folders_"            = "Hakuna folda hapa";
"_request_in_progress_"         = "Ombi kwenye seva linaendelea";
"_personal_files_only_"         = "Mafaili binafsi tu";

"audio"                         = "SAUTI";
"directory"                     = "MAFOLDA";
"document"                      = "NYARAKA";
"image"                         = "TASWIRA";
"template"                      = "VIOLEZO";
"video"                         = "VIDEO";

"_paste_file_"                  = "Bandika";
"_cancel_all_task_"             = "Sitisha hamisho zote";
"_status_wait_download_"        = "Subiri kwa kupakua";
"_status_downloading_"          = "Inapakua";
"_status_wait_upload_"          = "Inasubiri kupakia";
"_status_wait_create_folder_"   = "Inasubiri kutengeneza folda";
"_status_wait_delete_"          = "Inasubiri kufuta";
"_status_wait_rename_"          = "Inasubiri kuita jina upya";
"_status_wait_favorite_"        = "Inasubiri kubadili kipendwa";
"_status_wait_copy_"            = "Inasubiri kunakili";
"_status_wait_move_"            = "Inasubiri kuhama";
"_status_uploading_"            = "Inapakia";
"_status_upload_error_"         = "Hitilafu, ikisubiri kupakia";
"_select_media_folder_"         = "Pangilia folda ya media";
"_media_viewimage_show_"        = "Onesha taswira tu";
"_media_viewvideo_show_"        = "Onesha video tu";
"_media_show_all_"              = "Onesha vyote";
"_good_morning_"                = "Habari za asubuhi";
"_good_day_"                    = "Siku njema";
"_good_afternoon_"              = "Habari za mchana";
"_good_evening_"                = "Habari za jioni";
"_good_night_"                  = "Habari za usiku";
"_servers_"                     = "Seva";
"_select_server_"               = "Tafadhali chagua seva";

// MARK: Share

"_share_link_"                  = "Shirikisha kiungio";
"_share_link_name_"             = "Shirikisha jina";
"_password_"                    = "Nenosiri";
"_share_password_"              = "Kiungo kinacholindwa na nenosiri";
"_date_"                        = "Tarehe";
"_user_sharee_footer_"          = "Bofya kubadili ruhusa";
"_enforce_password_protection_" = "Tekeleza ulinzi wa nenosiri";
"_shared_with_you_by_"          = "Imeshirikishwa na wewe na";
"_shareLinksearch_placeholder_" = "Jina, barua pepe, au kitambulisho cha Cloud kilichoshirikishwa....";
"_new_comment_"                 = "Oni jipya";
"_edit_comment_"                = "Hariri oni";
"_delete_comment_"              = "Futa oni";
"_share_read_only_"             = "Tazama pekee";
"_share_editing_"               = "inaweza kuhariri";
"_share_allow_upload_"          = "Ruhusu kupakia na kuhariri";
"_share_file_drop_"             = "Ombi la faili";
"_share_secure_file_drop_"      = "Linda kushuka kwa faili (pakia tu)";
"_share_hide_download_"         = "Ficha upakuaji";
"_share_allowed_downloads_"     = "Vipakuliwa vinavyoruhusiwa";
"_share_limit_download_"        = "Zuia upakuaji";
"_remaining_"                   = "lliyobaki %d";
"_share_password_protect_"      = "Ulinzi wa nenosiri";
"_share_expiration_date_"       = "Pangilia tarehe ya mwisho wa matumizi";
"_share_note_recipient_"        = "Kumbuka kwa mpokeaji";
"_share_add_sharelink_"         = "Ogeza kiungio kingine";
"_share_can_read_"              = "Soma";
"_share_can_reshare_"           = "Shirikisha";
"_share_can_create_"            = "Unda";
"_share_can_change_"            = "Hariri";
"_share_can_delete_"            = "Futa";
"_share_can_download_"          = "Ruhusu upakuaji na kusawazisha";
"_share_unshare_"               = "Futa ushiriki";
"_share_internal_link_"         = "Kiungio cha ndani";
"_share_internal_link_des_"     = "Inafanya kazi kwa watumiaji walio na ufikiaji wa faili/folda hii pekee.";
"_share_reshare_disabled_"      = "Huruhusiwi kushiriki upya faili/folda hii.";
"_share_reshare_restricted_"    = "Kumbuka: Una ruhusa tu ya kushiriki upya faili/folda hii.";
"_remote_"                      = "Mbali";
"_remote_group_"                = "Kundi la mbali";
"_conversation_"                = "Mazungumzo";
"_no_transfer_"                 = "Bado hakuna hamisho";
"_no_transfer_sub_"             = "Vipakiwa na vipakuliwa kutoka kwa kifaa hiki vitaonekana hapa";
"_no_transfer_in_progress_"     = "No transfers in progress";
"_no_transfer_in_progress_sub_" = "Active uploads and downloads from this device will appear here.";
"_no_transfer_in_waiting_"      = "No transfers waiting";
"_no_transfer_in_waiting_sub_"  = "Transfers waiting to start will appear here.";
"_no_transfer_in_error_"        = "No transfer errors";
"_no_transfer_in_error_sub_"    = "Transfers that need your attention will appear here.";
"_transfers_waiting_shown_"     = "%1$d of %2$d transfers waiting";
"_no_activity_footer_"              = "Hakuna shughuli zaidi za kupakia";
"_transfers_"                       = "Hamisho";
"_activity_"                        = "Shughuli";
"_trash_file_not_found_"            = "Inaonekana kwamba faili haiko kwenye Tupio. Nenda kwenye Tupio ili kuisasisha na ujaribu tena.";
"_list_shares_"                     = "Viungio";
"_list_shares_no_files_"            = "Bado hakuna viungio";
"_tutorial_list_shares_view_"       = "Faili na folda unazoshirikisha zitaonekana hapa";
"_offline_"                         = "Nje ya mtandao";
"_upload_photos_videos_"            = "Pakia picha au video";
"_upload_file_"                     = "Pakia faili";
"_create_nextcloudtext_document_"   = "Tengeneza waraka wa maandishi";
"_use_folder_auto_upload_"          = "Tumia folda ya \"Pakia Kiotomatiki\" kama lengwa\n ";
"_filename_"                        = "Jina la faili";
"_enter_filename_"                  = "Ingiza jina la faili";
"_default_preview_filename_footer_" = "Mfano onyesho la kukagua jina la faili: IMG_0001.JPG";
"_filename_header_"                 = "Ingiza jina la faili";
"_preview_filename_"                = "Mfano onyesho la kukagua jina la faili. Unaweza kutumia barakoa %@ kwa tarehe/saa.";
"_add_filenametype_"                = "Bainisha aina katika jina la faili";
"_maintain_original_filename_"      = "Endeleza jina halisi la faili ";
"_notifications_"                   = "Taarifa";
"_untitled_"                        = "isiyo na kichwa cha habari";
"_e2e_settings_title_"              = "Usimbaji fiche";
"_e2e_settings_"                    = "Usimbaji fiche wa mwisho hadi mwisho";
"_e2e_settings_start_"              = "Anzisha usimbaji fiche kutoka mwisho hadi mwisho\n ";
"_e2e_settings_activated_"          = "Usimbaji fiche kutoka mwisho hadi mwisho umewashwa";
"_e2e_server_disabled_"             = "Programu ya usimbaji-mwisho-hadi-mwisho imezimwa kwenye seva";
"_e2e_settings_view_passphrase_"    = "Maneno yote 12 kwa pamoja hutengeneza nenosiri imara, huku kuruhusu wewe tu kutazama na kutumia faili zako zilizosimbwa. Tafadhali iandike na uiweke mahali salama.";
"_e2e_settings_read_passphrase_"    = "Soma nenosiri";
"_e2e_settings_lock_not_active_"    = "Kufuli haitumiki. Nenda kwa \"Mipangilio\" na uiwashe.";
"_e2e_settings_the_passphrase_is_"  = "Nenosiri ni:";
"_e2e_passphrase_request_title_"    = "Omba nenosiri";
"_e2e_passphrase_request_message_"  = "Ingiza maneno 12";
"_e2e_settings_remove_"             = "Ondoa simbaji fiche kikawaida";
"_e2e_settings_remove_message_"     = "Thibitisha kuondolewa kwa usimbaji fiche pamoja na kaulisiri.";
"_e2e_set_folder_encrypted_"        = "Simba kwa njia fiche";
"_e2e_remove_folder_encrypted_"     = "Simbua";
"_e2e_file_encrypted_"              = "Faili imesimbwa kwa njia fiche";
"_e2e_goto_settings_for_enable_"    = "Hii ni saraka iliyosimbwa kwa njia fiche, nenda kwa \"Mipangilio\" na uwashe usimbaji fiche kutoka mwisho hadi mwisho.";
"_e2e_in_upload_"                   = "Upakiaji unaendelea, tafadhali subiri faili zote zihamishwe.";
"_scans_document_"                  = "Waraka ulioskaniwa";
"_scanned_images_"                  = "Taswira zilizoskaniwa ";
"_scan_document_pdf_page_"          = "Ukurasa";
"_scan_label_document_zone_"        = "Tap or drag images down for document creation";
"_filter_document_"                 = "Waraka";
"_filter_original_"                 = "Halisi";
"_quality_image_title_"             = "Tazama ubora wa taswira";
"_file_creation_"                   = "Uundaji wa faili";
"_delete_all_scanned_images_"       = "Futa taswira zote zilizoskaniwa";
"_text_recognition_"                = "Utambuzi wa maandishi";
"_all_files_"                       = "Faili zote";
"_personal_files_"                  = "Faili binafsi";

"_trash_view_"                      = "Faili zilizofutwa";
"_empty_trash_"                     = "Pipa tupu la takataka";
"_trash_no_trash_"                  = "Hakuna faili zilizofutwa";
"_trash_no_trash_description_"      = "Unaweza kuhifadhi upya faili zilizofutwa kuanzia hapa";
"_confirm_delete_selected_"         = "Una uhakika unataka kufuta vifungu vilivyochaguliwa?";
"_manage_file_offline_"             = "Simamia faili nje ya mtandao";
"_set_available_offline_"           = "Pangilia kama zilizopo nje ya mtandao";
"_remove_available_offline_"        = "Ondoa kama zilizopo nje ya mtandao";
"_create_new_document_"             = "Waraka";
"_create_new_spreadsheet_"          = "Spreadsheet";
"_create_new_presentation_"         = "Presentation";
"_create_new_diagram_"              = "Diagram";
"_more_documents_"                  = "More Documents";
"_go_online_"                       = "Ingia mtandaoni kuona faili";
"_intro_1_title_"                   = "Weka data zako salama na chini ya uangalizi wako";
"_intro_2_title_"                   = "Linda ushirikiano na ubadilishaji wa faili";
"_intro_3_title_"                   = "Rahisi kutumia barua ya mtandai, kalenda na mawasiliano";
"_intro_4_title_"                   = "Ushikishanaji wa screen, mikutano ya mtandaoni na mikutano ya wavuti";
"_log_in_"                          = "Ingia";
"_sign_up_"                         = "Jisajili na mtoa huduma";
"_host_your_own_server"             = "Pangisha seva yako mwenyewe";
"_invalid_url_"                         = "Seva ya URL ni batili";
"_ssl_certificate_untrusted_"           = "Cheti cha seva hii ni batili.";
"_ssl_certificate_changed_"             = "Cheti cha seva hii inaonekana kuwa kimebadilika.";
"_file_already_exists_"                 = "Haiwezi kukamilisha oparesheni, faili lenye jina sawasawa lipo";
"_error_files_upload_"                  = "Hitilafu wakati wa kupakia faili";
"_internal_generic_error_"              = "Hitilafu ya ndani";
"_err_permission_microphone_"           = "Tafadhali ruhusu matumizi ya Maikrofoni kutoka kwa Mipangilio.";
"_err_permission_photolibrary_"         = "Tafadhali ruhusu Picha kutoka kwa Mipangilio.";
"_qrcode_not_authorized_"   = "Programu hii haijaidhinishwa kutumia Kamera ya Nyuma.";
"_qrcode_not_supported_"    = "Msimbo wa QR hautumiki na kifaa cha sasa.";
"_create_voice_memo_"       = "Tengeneza memo ya sauti";
"_voice_memo_start_"        = "Gusa kuanza";
"_voice_memo_stop_"         = "Gusa kusitisha";
"Enter Passcode"            = "Ingiza nambari ya siri";
"Enter a new passcode"      = "Ingiza nambari mpya ya siri";
"Confirm new passcode"      = "Thibitisha nambari mpya ya siri";
"_too_many_failed_passcode_attempts_error_" = "Majaribio mengi mno ya nambari ya siri ambayo hayakufaulu. Tafadhali jaribu tena.";
"Passcodes didn't match. Try again." = "Nambari za siri hazikulingana. Jaribu tena.";
"Delete"                    = "Futa";
"Cancel"                    = "Ghaili";
"_certificate_details_"     = "Maelezo ya seva ya cheti";
"_certificate_pn_details_"  = "Maelezo ya Arifa ya Usukumaji wa Cheti";
"_certificate_view_"        = "Seva ya cheti";
"_certificate_pn_view_"     = "Arifa ya Kushinikiza Cheti";
"_save_as_scan_"            = "Hifadhi kama scani";
"_save_changes_"            = "Save changes?";
"_modify_"                  = "Boresha";
"_overwrite_original_"      = "Badilisha halisi";
"_save_as_copy_"            = "Hifadhi kama nakala";
"_discard_changes_"         = "Discard changes";
"_message_disable_overwrite_livephoto_" = "Picha hii ni Picha ya Moja kwa Moja, haitawezekana kuibatilisha.";
"_discard_changes_info_"    = "Mabadiliko yako yatatupwa.";
"_delete_files_desc_"       = "Futa faili ili upate nafasi";
"_delete_old_files_"        = "Futa, kwenye kashe, faili zote za zamani kuliko";
"_never_"                   = "kamwe";
"_1_year_"                  = "mwaka 1";
"_6_months_"                = "miezi 6";
"_3_months_"                = "miezi 3";
"_1_month_"                 = "mwezi 1";
"_1_week_"                  = "wiki 1";
"_monthly_"                 = "Kila mwezi";
"_yearly_"                  = "Kila mwaka";
"_daily_"                   = "Kila siku";
"_used_space_"              = "Nafasi iliyotumika";
"_login_address_detail_"    = "Kiungo kwa %@ kiolesura chako cha wavuti unapokifungua kwenye kivinjari.";
"_go_to_page_"              = "Nenda kwenye ukurasa";
"_page_"                    = "Ukurasa";
"_this_document_has_%@_pages_"              = "Waraka huu una kurasa %@";
"_invalid_page_"                            = "Ukurasa batili";
"_the_entered_page_number_does_not_exist_"   = "Nambari ya ukurasa iliyoingizwa haipo.";
"_error_something_wrong_"   = "Kitu fulani kimeenda vibaya";
"_try_download_full_resolution_"            = "Pakua picha ya mwonekano kamili";
"_full_resolution_image_info_"            = "Hii inaweza kuonesha taarifa zaidi kuhusu picha";
"_download_audio_"          = "Pakua sauti kikawaida";
"_copied_path_"             = "Njia iliyonakiliwa";
"_privacy_screen_"          = "Hide content when app is inactive";
"_privacy_screen_footer_"   = "Hide the content in the app and show a splash screen when the app is inactive.";
"_in_"                      = "Ndani ya";
"_enter_passphrase_"        = "Ingiza nenosiri (maneno 12)";
"_show_more_results_"       = "⋯ Load more results";
"_waiting_for_"             = "Inasubiria:";
"_reachable_wifi_"          = "Mtandao unafikika kupitia WI-FI au waya";
"_copy_passphrase_"         = "Nakili nenosiri";
"_ok_copy_passphrase_"      = "Sawa na unakili nenosiri";
"_select_color_"            = "Chagua rangi";
"_change_color_"            = "Badili rangi";
"_description_dashboardwidget_" = "Kuwa na Dashibodi kiganjani mwako daima haijawahi kuwa rahisi.";
"_description_fileswidget_" = "Tazama faili zako za hivi majuzi na utumie upau wa vidhibiti ili kuharakisha shughuli zako.";
"_description_toolbarwidget_"   = "Upau wa vidhibiti ili kuharakisha shughuli zako.";
"_title_lockscreenwidget_"  = "Hadhi";
"_description_lockscreenwidget_"    = "Fuatilia nafasi inayopatikana na shughuli za hivi karibuni";

"_keep_running_"            = "Endelea kuendesha programu kwa matumizi bora ya mtumiaji.";
"_apps_nextcloud_detect_"   = "Programu %@zimegunduliwa";
"_add_existing_account_"    = "Programu Nyingine %@ zimetambuliwa, ungependa kuongeza akaunti iliyopo?";
"_status_in_progress_"      = "Usomaji wa wadhifa unaendelea…";
"_status_e2ee_on_server_"   = "Usimbaji fiche wa mwanzo hadi mwisho tayari umesanidiwa katika seva lakini bado haujawezeshwa kwenye kifaa hiki.";
"_status_e2ee_not_setup_"   = "Usimbaji fiche wa mwisho hadi mwisho bado haujasanidiwa kwenye seva.";
"_status_e2ee_configured_"  = "Usimbaji fiche kutoka mwisho hadi mwisho umesanidiwa ipasavyo.";
"_e2ee_set_as_offline_"     = "Hairuhusiwi kwa faili au folda zilizosimbwa";
"_change_upload_filename_"  = "Je, unataka kuhifadhi faili na jina tofauti?";
"_save_file_as_"            = "Hafadhi faili kama %@";
"_password_ascii_"          = "Nenosiri haliwezi kujumuisha wahusika maalum";
"_calendar_contacts_"       = "Kalenda na Mawasiliano";
"_mobile_config_"           = "Pakua wasifu wa usanidi";
"_calendar_contacts_footer_warning_"    = "Wasifu wa usanidi unaweza kupakuliwa tu ikiwa Safari imewekwa kama kivinjari chaguo-msingi.";
"_calendar_contacts_footer_"    = "Baada ya kupakua wasifu unaweza kuusakinisha kutoka kwa Mipangilio.";
"_modify_image_desc_"       = "Bonyeza kwenye faili ili kurekebisha au kubadilisha jina.";
"_message_disable_livephoto_" = "Picha hii ni Picha ya Moja kwa Moja, kuibadilisha kutapoteza athari ya Picha Moja kwa Moja.";
"_enable_livephoto_"        = "Wezesha picha ya moja kwa moja";
"_disable_livephoto_"       = "Zima picha mubashara";
"_undo_modify_"             = "Tengua maboresho";
"_rename_already_exists_"   = "Faili lenye jina hili lipo tayari";
"_group_folders_"           = "Team folders";
"_play_from_files_"         = "Play video from a file";
"_play_from_url_"           = "Play video from a link";
"_valid_video_url_"         = "Ingiza URL halali";
"_chunk_move_"              = "Faili iliyotumwa haikuunganishwa tena, tafadhali angalia kumbukumbu ya seva.";
"_download_image_"          = "Pakua taswira/picha";
"_download_video_"          = "Pakua video";
"_reset_wrong_passcode_"    = "Resetting application...";
"_reset_wrong_passcode_option_" = "Reset application after 10 failed attempts";
"_reset_wrong_passcode_desc_" = "Enabling this will remove all accounts and local data after %d failed passcode entry attempts.";
"_deviceOwnerAuthentication_" = "Sensa ya kibayometriki imezimwa kwa muda kutokana na majaribio mengi yasiyofaulu. Weka nambari ya siri ya kifaa ili kuwezesha tena kihisi.";
"_virus_detect_"            = "Virusi vimegunduliwa. Upakiaji hauwezi kukamilika!";
"_select_photos_"           = "Chagua picha";
"_selected_photo_"          = "Picha iliyochaguliwa";
"_selected_photos_"         = "Picha zilizochaguliwa";
"_delete_selected_photos_"  = "Futa picha zilizochaguliwa";
"_media_square_"            = "Gridi ya mraba";
"_media_ratio_"             = "Gridi ya uwiano wa kipengele";
"_autoupload_notice_"       = "Ili kuhakikisha utendakazi ufaao wa kipengele hiki, ni muhimu kuwasha Upyaji wa Programu Chinichini. Vinginevyo, picha au video mpya hazitatambuliwa wakati programu iko chinichini.\n\nZaidi ya hayo, tafadhali kumbuka kuwa programu haitaweza kugundua picha na video mpya ikiwa itakatishwa mwenyewe. Programu ikiwa chinichini, uhamishaji wa data unaweza kuwa polepole, na picha na/au video mpya kwa ujumla zitatambuliwa kila baada ya dakika 10, kulingana na kiwango cha betri ya kifaa.\n\nIli kuthibitisha kwamba programu inafanya kazi kwa usahihi, unaweza kutumia faili ya kumbukumbu inayopatikana katika mipangilio ya Kina.";
"_display_"                 = "Onekana";
"_appearance_"              = "Mwonekano";
"_light_"                   = "Mwanga";
"_dark_"                    = "Giza";
"_use_system_style_"        = "Tumia mtindo wa mfumo";
"_account_settings_"        = "Mipangilio ya akaunti";
"_users_"                   = "Watumiaji";
"_users_footer_"            = "Allows you to select an account every time you open the app.";
"_while_charging_"          = "Wakati ikibadili";
"_keep_screen_awake_"       = "Weka skrini ikiwa macho\nwakati wa kuhamisha faili";
"_error_not_found_"         = "Nyenzo iliyoombwa haikupatikana";
"_error_conflict_"          = "Ombi halijakamilika kwa sababu ya mgongano na hali ya sasa ya nyenzo";
"_error_precondition_"      = "Seva haifikii mojawapo ya masharti ya mwombaji";
"_downloading_"             = "Inapakua";
"_additional_options_"      = "Mibadala ya nyongeza";
"_unauthorizedFilesPasscode_" = "Programu ya faili haiwezi kutumiwa na nambari ya siri iliyoamilishwa";
"_disableFilesApp_"         = "Programu ya faili haiwezi kutumika kwa sababu imezimwa";
"_widget_available_nc25_"   = "Wijeti inapatikana tu kuanzia na toleo la 25 la seva";
"_no_items_"                = "Hakuna kipengele";
"_check_back_later_"        = "Angalia herufi ya nyuma";
"_no_data_available_"       = "Hakuna data zilizopoz";
"_recent_activity_"         = "Shughuli ya sasa";
"_maintenance_mode_"        = "Seva kwa sasa iko katika hali ya matengenezo, ambayo inaweza kuchukua muda.";
"_account_disabled_"        = "Akaunti imezimwa";
"_user_"                    = "Mtumiaji";
"_add_subtitle_"            = "Ongeza manukuu ya nje";
"_add_audio_"               = "Ongeza sauti ya nje";
"_upload_foreground_msg_"   = "Usifunge %@ kukamilisha uhamishaji";
"_upload_background_msg_"   = "Upakiaji wa faili unaendelea...";
"_create_folder_error_"     = "Hitilafu imetokea wakati wa kuunda folda:\n%@.\n\nTafadhali suluhisha suala hilo haraka iwezekanavyo.\n\nUpakiaji wote umesimamishwa hadi tatizo litatuliwe.";
"_creating_dir_progress_"   = "Kuunda saraka kunaendelea ... fanya programu kuwa hai.";
"_creating_db_photo_progress_" = "Uundaji wa kumbukumbu ya picha unaendelea ... weka programu amilifu.";
"_account_unauthorized_"    = "There was an issue authorizing the account %@. Please log in again.";
"_folder_offline_desc_"     = "Hata bila muunganisho wa mtandao, unaweza kupanga folda zako, kuunda faili. Ukisharejea mtandaoni, vitendo vyako vinavyosubiri vitasawazishwa kiotomatiki.";
"_offline_not_allowed_"     = "Operesheni hii hairuhusiwi katika hali ya nje ya mtandao";
"_Upload_native_format_yes_"= "Pakia katika umbizo asili: ndiyo";
"_Upload_native_format_no_" = "Pakia katika umbizo asili: hapana";
"_terms_of_service_"        = "Masharti ya huduma";
"_terms_accept_"            = "Ninakubali kwamba nimesoma na kukubaliana na sheria na masharti ya hapo juu.";
"_terms_accepted_"          = "Masharti yaliyokubaliwa";
"_recommended_files_"       = "Faili zilizopendekezwa";
"_propagate_layout_"        = "Tekeleza mabadiliko yafuatayo kwa folda zote ndogo";
"_version_mismatch_error_"  = "Mabadiliko ya toleo: tafadhali fungua programu kuu ili kusasisha data.";
"_check_auto_upload_"       = "Automatic photo upload is currently disabled.\nWith Nextcloud iOS you can automatically back up your photos and keep them safe on your server.\nJust open Settings → Auto Upload, choose the options you prefer, and turn it on with the \"%@\" button.";
"_cancel_all_request_"      = "Are you sure you want to cancel all transfers?";
"_cancel_all_"              = "Cancel All";
"_dismiss_"                 = "Ondoa";
"_opt_in_pro_"              = "Optimization in progress …";
"_update_in_progress_"      = "Update in progress …";
"_delete_in_progress_"      = "Delete in progress …";
"_download_in_progress_"    = "Download in progress …";
"_upload_in_progress_"      = "Upload in progress …";
"_transfer_in_progress_"    = "Transfer in progress …";
"_in_waiting_"              = "In waiting";
"_in_progress_"             = "In progress";
"_in_error_"                = "In error";
"_retry_minutes_"           = "min left to retry";
"_retry_seconds_"           = "sec left to retry";
"_retry_soon_"              = "retrying soon …";
"_large_upload_tip_"        = "Large files require the app to remain open until the transfer is complete";
"_e2ee_upload_tip_"         = "End-to-end files require the app to remain open until the transfer is complete";
"_finalizing_wait_"         = "Waiting for finalization …";
"_in_this_folder_"          = "In this folder";
"_media_no_longer_available_" = "Media no longer available";
"_this_item_has_been_deleted_" = "This item has been deleted.";
"_video_not_available_" = "Video not available";
"_disable_" = "Disable";
"_no_subtitles_available_" = "No subtitles available";
"_no_audio_tracks_available_" = "No audio tracks available";
"_add_external_subtitle_" = "Add external subtitle";
"_repeat_current_media_" = "Repeat current item";
"_play_next_media_automatically_" = "Play next item automatically";
"_image_load_failed_" = "Image load failed";
"_image_load_failed_" = "Image load failed";
"_gif_file_could_not_be_decoded_" = "GIF file could not be decoded";
"_svg_file_could_not_be_rendered_" = "SVG file could not be rendered";
"_image_file_could_not_be_decoded_" = "Image file could not be decoded";
"_media_not_available_" = "Media not available";
"_no_assistant_installed_"  = "Assistant is not installed on this server. Ask your administrator to install the Assistant app";
"_open_in_office_" = "Open in Office";
"_select_date_" = "Select date";
"_always_play_with_vlc_" = "Always play with VLC";
"_account_not_available_" = "Account not available";
"_autoupload_active_other_account_title_" = "Auto upload is already active";
"_autoupload_active_other_account_message_" = "Auto upload is already enabled for “%@”. Disable it for that account before enabling it here.";
"_autoupload_cleanup_pending_" = "Previous uploads are still being stopped. Try starting the backup again to retry cleanup.";

// Tip
"_tip_pdf_thumbnails_"      = "Telezesha kidole kushoto kutoka ukingo wa kulia wa skrini ili kuonyesha vijipicha";
"_tip_accountrequest_"      = "Gusa hapa ili kubadilisha akaunti au kuongeza mpya";
"_tip_addcopyimage_"        = "Bonyeza kwa muda mrefu ili kubandika picha iliyonakiliwa";
"_tip_open_mediadetail_"    = "Telezesha kidole juu ili kuonyesha maelezo";
"_tip_autoupload_button_"   = "Sanidi chaguo upendavyo (folda, Wi-Fi, maudhui mapya, folda ndogo) na ugonge 'Washa upakiaji otomatiki'.\nUnaweza kuisimamisha wakati wowote, kurekebisha mipangilio na kuiwasha tena.";

// MARK: Accessibility

// Accessibility, floating panel top element
"_cart_controller_"             = "Mmiliki wa kadi ";
"_accessibility_add_upload_"    = "Ongeza na pakia";
"_dismiss_menu_"                = "Ondoa mwongozo";
"_show_profile_"                = "Onesha wasifu";
// a11y: On/Off
"_on_"                          = "Imewashwa";
// a11y: On/Off
"_off_"                         = "Imezimwa";
"_list_"                        = "Orodha";
"_icons_"                       = "Aikoni";

// MARK: Assistant
"_assistant_task_unknown_"       = "Asiyejulikana";
"_assistant_task_scheduled_"     = "Imepangwa";
"_assistant_task_in_progress_"   = "Inaendelea";
"_assistant_task_completed_"     = "Imemalizika";
"_assistant_task_failed_"        = "Imeshindwa";
"_input_"                        = "Maingio";
"_output_"                       = "Matoleo";
"_task_details_"                 = "Maelezo ya kazi";
"_assistant_"                    = "Msaidizi";
"_new_task_"                     = "Kazi mpya %@";
"_no_tasks_"                     = "Hello there! What can I help you with today?";
"_create_task_subtitle_"         = "Use the + button to create a new task";
"_edit_task_"                    = "Hariri kazi %@";
"_no_types_"                     = "Hakuna mtoahuduma aliyepatikana";
"_no_types_subtitle_"            = "Watoa Huduma za AI wanahitaji kusakinishwa ili kutumia usaidizi.";
"_assistant_ai_warning_"         = "Output shown here is generated by AI. Make sure to always double-check.";
"_no_chat_subtitle_"             = "Try sending a message to spark a conversation.";
"_retry_response_generation_"    = "Retry response generation";
"_conversations_"                = "Mazungumzo";
"_new_conversation_"             = "Mazungumzo mapya";
"_type_message_"                 = "Type a message...";
"_assistant_chat_"               = "Assistant Chat";
"_assistant_error_send_message_"  = "Could not send message. Please try again.";
"_assistant_error_load_messages_" = "Could not load messages. Please try again.";
"_assistant_error_generate_response_" = "Could not generate response. Please try again.";

// MARK: Client certificate
"_no_client_cert_found_"         = "Seva inaomba cheti cha mteja.";
"_no_client_cert_found_desc_"    = "Je, ungependa kusakinisha cheti cha mteja wa TLS? \nKumbuka kuwa cheti cha .p12 lazima kisakinishwe kwenye kifaa chako kwanza kwa kubofya na kukisakinisha kama Wasifu wa Cheti cha Utambulisho katika Mipangilio. Cheti LAZIMA pia kiwe na nenosiri kwani hilo ni hitaji la iOS.";
"_client_cert_enter_password_"   = "Ingiza nenosiri kwenye cheti kilichochaguliwa";
"_client_cert_wrong_password_"   = "Samahani, umeingiza nenosiri batili";

// MARK: Login poll
"_poll_desc_"                    = "Tafadhali kamilisha mchakato wa uingiaji katika wavuti wako";

// MARK: File name validator (used by NextcloudKit, don't remove)
"_file_name_validator_error_ends_with_space_period_" = "Jina halipaswi kujumuisha nafasi mwanzoni au mwishoni";
"_file_name_validator_error_reserved_name_" = "\"%@\" ni jina lililozuiliwa";
"_file_name_validator_error_forbidden_file_extension_" = "\"%@\" ni kiendelezi cha faili iliyofichwa";
"_file_name_validator_error_invalid_character_" = "Jina linajumuisha mhusika batili \"%@\"";
"_file_name_validator_error_space_" = "Jina halipaswi kujumuisha nafasi mwanzoni au mwishoni";
"_file_name_new_extension_" = "Kubadilisha kiendelezi kunaweza kusababisha faili hii kufunguka katika programu tofauti.";
"_file_name_empty_" = "Jina la faili haliwezi kuwa tupu.";
"_please_rename_file_" = "Tafadhali ita jina jipya faili au folda";
"hidden_file_name_warning" = "Jina litasababisha faili iliyofichwa.";

"_camera_roll_" = "Mzunguko wa kamera";
"_destination_" = "Lengwa";
"_select_autoupload_albums_" = "Chagua albamu";
"_upload_from_" = "Pakua kutokea";
"_multiple_albums_" = "Albamu zaidi";
"_smart_albums_" = "Albamu janja";
"_albums_" = "Albamu";
"_new_photos_only_" = "Picha mpya tu";
"_all_photos_" = "Picha zote";
"_back_up_new_photos_only_" = "Hifadhi nakala za picha/video mpya pekee";
"_auto_upload_all_photos_warning_title_" = "Je, una uhakika unataka kupakia picha zote?";
"_auto_upload_all_photos_warning_message_" = "Hii inaweza kuchukua muda kuchakatwa kulingana na idadi ya picha.";
"_auto_upload_no_new_items_to_upload_" = "No new items to upload";
"_background_upload_extension_" = "PhotoKit background upload extension";
"_experimental_" = "Experimental";
"_background_upload_extension_footer_" = "Experimental: delegate automatic photo uploads to PhotoKit in the background. The compatibility setting (HEIC to JPG) is ignored, so HEIC images are uploaded in their original format.";
"_background_upload_extension_apache_title_" = "Apache configuration required";
"_background_upload_extension_apache_warning_" = "Servers without resumable upload support must return 501 for PhotoKit OPTIONS requests. With mod_rewrite enabled, add these rules to the Nextcloud VirtualHost before its existing rewrite rules, then reload Apache:";
"_auto_upload_suspended_" = "Automatic upload paused due to an error";
"_auto_upload_suspended_error_" = "Automatic upload paused: %@";
"_focused_auto_upload_" = "Focused Auto Upload";
"_focused_auto_upload_settings_footer_" = "Keep the app open and darken the screen while auto upload is backing up at higher speed.";
"_focused_auto_upload_intro_heading_" = "Keep backing up with the screen darkened.";
"_focused_auto_upload_intro_message_" = "Photos and videos will continue backing up at higher speed while the screen is darkened. During the process:";
"_focused_auto_upload_wifi_" = "Connect to Wi-Fi";
"_focused_auto_upload_charger_" = "Connect to charger";
"_focused_auto_upload_do_not_exit_" = "Do not exit the app";
"_enable_focused_auto_upload_" = "Enable Focused Auto Upload";
"_focused_auto_upload_backing_up_" = "Backing up";
"_focused_auto_upload_completed_" = "Upload completed!";
"_focused_auto_upload_countdown_" = "Do not lock the screen or exit the app. The screen will turn dark in %d seconds.";
"_stop_focused_auto_upload_" = "Stop Focused Auto Upload";
"_finish_" = "Maliza";
"_item_with_same_name_already_exists_" = "Kipengee chenye jina sawa tayari kipo.";

// MARK: Migration Multi Domains
"_preparing_migration_" = "Inatayarisha uhamiaji…";
"_scanning_files_" = "Inachanganua faili...";
"_moving_items_to_domain_" = "Inahamisha vipengee ili kurekebisha kikoa...";
"_finishing_up_" = "Inamalizia…";

// MARK: E2EE
"_e2ee_no_session_" = "End-to-end encryption error, no account for this session";
"_e2ee_no_dir_" = "End-to-end encryption error, cannot get directory";
"_e2ee_no_certificate_" = "End-to-end encryption error, cannot get certificate";
"_e2ee_no_generate_key_" = "End-to-end encryption error, cannot generate key";
"_e2ee_no_metadataKey_found_" = "End-to-end encryption error, cannot decrypt metadata key";
"_e2ee_read_only_" = "This encrypted folder uses an archived key set and is available as read-only.";
"_e2ee_server_key_changed_" = "The end-to-end encryption keys for this account changed on another device. Enter the new passphrase to update this device. Storage spaces associated with previous keys will remain available as read-only.";
"_e2ee_server_key_changed_title_" = "Encryption keys changed";
"_e2ee_no_user_found_" = "End-to-end encryption error, user not found";
"_e2ee_no_signature_found_" = "End-to-end encryption error, no signature found";
"_e2ee_counter_check_" = "End-to-end encryption error, the counter is lower than the previous one";
"_e2ee_signature_failed_" = "End-to-end encryption error, verify signature failed";
"_e2ee_enc_payload_" = "End-to-end encryption error, encrypt payload file";
"_e2ee_no_metadata_" = "End-to-end encryption error, cannot get metadata";
"_e2ee_filedrop_ciphertext_" = "End-to-end encryption error, filedrop ciphertext failed";
"_e2ee_key_ciphertext_" = "End-to-end encryption error, key ciphertext failed";
"_e2ee_key_no_checksum_found_" = "End-to-end encryption error, no checksum found";
"_e2ee_checksum_error_title_" = "End-to-end encryption checksum error";
"_e2ee_checksum_error_message_" = "The encrypted file checksum is missing or invalid.\n\nThis may be caused by incomplete, outdated, or inconsistent encryption metadata and does not necessarily mean that the file or server has been compromised.\n\nContinue only if you trust this server and understand the risk. Otherwise, exit without opening the file.";
"_e2ee_key_checksum_" = "End-to-end encryption error, key checksum failed";
"_e2ee_decode_metadata_" = "End-to-end encryption error, cannot decode metadata";
"_e2ee_no_lock_" = "End-to-end encryption error, unable to lock file";
"_e2ee_no_decrypt_metadata_" = "End-to-end encryption error, cannot decrypt metadata";
"_e2ee_no_enc_file_" = "End-to-end encryption error, cannot encrypt file";
"_e2ee_no_enc_key_" = "End-to-end encryption error, cannot get encoded key";
"_e2ee_no_match_checksum_" = "End-to-end encryption error, checksum does not match";
"_e2ee_create_folder_" = "End-to-end encryption directory creation in progress, please wait …";
"_e2ee_rename_file_" = "End-to-end encryption rename in progress, please wait …";
"_e2ee_encrypt_folder_" = "End-to-end encryption folder in progress, please wait …";
"_e2ee_setup_get_certificate_" = "Server did not return a certificate";
"_e2ee_setup_create_csr_" = "Unable to generate certificate signing request (CSR)";
"_e2ee_setup_sign_certificate_" = "Server did not return a certificate after signing request";
"_e2ee_setup_extract_publickey_" = "Public key mismatch between generated key and certificate";
"_e2ee_setup_get_privatekey_" = "Server did not return an encrypted private key";
"_e2ee_setup_passphrase_error_" = "The provided passphrase is incorrect";
"_e2ee_setup_get_publickey_" = "Server did not return an encrypted public key";
"_e2ee_setup_encript_privatekey_" = "Unable to encrypt the private key";
"_e2ee_setup_store_privatekey_" = "Private key generation returned no usable key";
"_e2ee_setup_verify_publickey_" = "Public key does not match the certificate";
"_e2ee_setup_generate_passphrase_" = "Unable to generate a passphrase";
"_e2ee_setup_privatekey_missing_" = "The End-to-end encryption private key could not be found.";
"_e2e_renew_certificate_success_" = "Your end-to-end encryption certificate has been renewed.";
"_certificate_valid_from_" = "Valid from";
"_certificate_valid_until_" = "Valid until";
"_certificate_" = "Certificate";
"_certificate_renew_" = "Renew certificate";

// Share details — Governance
"_governance_"                      = "Governance";
"_sensitivity_label_"               = "Sensitivity label";
"_file_retention_"                  = "File retention";
"_legal_hold_"                      = "Legal hold";
"_none_"                            = "Hakuna";
"_sections_"                        = "Sections";
"_governance_labels_load_error_"    = "Governance labels could not be loaded.";

// MARK: Albums
"_albums_loading_popup_desc_"                       = "Wait a moment …";
"_albums_list_nav_title_"                           = "Albamu";
"_albums_list_new_album_btn_"                       = "New album";
"_albums_list_loading_msg_"                         = "Inapakia";
"_albums_list_error_msg_"                           = "Unable to load albums. Please try again later!";
"_albums_list_album_name_validation_nonempty_"      = "Album name cannot be empty.";
"_albums_list_album_name_validation_min_length_"    = "Album name must be at least 3 characters.";
"_albums_list_album_name_validation_max_length_"    = "Album name cannot be more than 30 characters.";
"_albums_list_album_name_validation_specials_"      = "Album name cannot contain slashes.";
"_albums_list_empty_heading_"                       = "Create Albums for your Photos";
"_albums_list_empty_subheading_"                    = "You can organize all your photos in as many albums as you like. You haven't created an album yet.";
"_albums_list_empty_new_album_btn_"                 = "Create album";
"_albums_list_own_albums_heading_"                  = "My albums";
"_albums_list_date_range_"                          = "%@ to %@";
"_albums_list_new_album_popup_title_"               = "Create new Album";
"_albums_list_new_album_popup_desc_"                = "Please enter an album name between 3 and 30 characters.";
"_albums_list_new_album_popup_hint_"                = "Album's name";
"_albums_list_new_album_popup_positive_btn_"        = "Unda";
"_albums_list_new_album_popup_negative_btn_"        = "Ghaili";
"_albums_list_rename_album_popup_title_"            = "Rename Album";
"_albums_list_rename_album_popup_desc_"             = "Please enter new album name between 3 and 30 characters.";
"_albums_list_rename_album_popup_hint_"             = "Album's new name";
"_albums_list_rename_album_popup_positive_btn_"     = "Badili jina";
"_albums_list_rename_album_popup_negative_btn_"     = "Ghaili";
"_albums_photo_selection_sheet_title_"              = "Chagua picha";
"_albums_photos_loading_msg_"                       = "Loading photos …";
"_albums_photos_error_msg_"                         = "Unable to load photos. Please try again later!";
"_albums_photos_empty_heading_"                     = "All that's missing are your photos";
"_albums_photos_empty_subheading_"                  = "You can add as many photos as you like. A photo can also belong to more than one album.";
"_albums_photos_add_photos_btn_"                    = "Add photos";
"_albums_photos_rename_album_btn_"                  = "Rename Album";
"_albums_photos_delete_album_btn_"                  = "Delete Album";
"_albums_delete_album_popup_title_"                 = "Delete Album?";
"_albums_delete_album_popup_desc_"                  = "Are you sure you want to delete this album? This action cannot be undone.";
"_albums_delete_album_popup_positive_btn_"          = "Futa";
"_albums_delete_album_popup_negative_btn_"          = "Ghaili";
"_add_to_album"                                     = "Add to Album";
"_remove_from_album_"                               = "Remove from Album";
"_want_remove_from_album_"                          = "Do you really want to remove from Album?";


"_autoupload_whole_library_" = "Whole photo library";
"_autoupload_whole_library_description_" = "Checks the entire selected library. Files already uploaded to %@ are skipped.";
"_autoupload_from_date_" = "From a date";
"_autoupload_start_date_" = "Upload starting from";
"_autoupload_completed_until_" = "Upload completed up to";
"_autoupload_waiting_for_uploads_" = "Waiting for the first uploads";
"_autoupload_set_to_now_" = "Set to now";
"_autoupload_date_range_footer_" = "Files already uploaded to %@ are skipped. The date advances through confirmed uploads and is preserved when auto upload is stopped.";
